#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
aws_iam_role.batch_role: Refreshing state... [id=batch_role]
aws_security_group.batch_security_group: Refreshing state... [id=sg-05f28f03e0bcde8aa]
aws_iam_role_policy_attachment.policy_attachment: Refreshing state... [id=batch_role-20220405015944530800000001]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.create_S3_bucket.aws_s3_bucket.bucket1 will be created
  + resource "aws_s3_bucket" "bucket1" {
      + acceleration_status                  = (known after apply)
      + acl                                  = (known after apply)
      + arn                                  = (known after apply)
      + bucket                               = "learning-dev-grahamwright.net"
      + bucket_domain_name                   = (known after apply)
      + bucket_regional_domain_name          = (known after apply)
      + cors_rule                            = (known after apply)
      + force_destroy                        = false
      + grant                                = (known after apply)
      + hosted_zone_id                       = (known after apply)
      + id                                   = (known after apply)
      + lifecycle_rule                       = (known after apply)
      + logging                              = (known after apply)
      + object_lock_enabled                  = (known after apply)
      + policy                               = (known after apply)
      + region                               = (known after apply)
      + replication_configuration            = (known after apply)
      + request_payer                        = (known after apply)
      + server_side_encryption_configuration = (known after apply)
      + tags                                 = {
          + "CustomTag"   = "made_with_tf"
          + "Environment" = "dev-envtag"
          + "Name"        = "learning-dev-nametag"
        }
      + tags_all                             = {
          + "CustomTag"   = "made_with_tf"
          + "Environment" = "dev-envtag"
          + "Name"        = "learning-dev-nametag"
        }
      + versioning                           = (known after apply)
      + website                              = (known after apply)
      + website_domain                       = (known after apply)
      + website_endpoint                     = (known after apply)

      + object_lock_configuration {
          + object_lock_enabled = (known after apply)
          + rule                = (known after apply)
        }
    }

  # module.create_S3_bucket.aws_s3_bucket_acl.bucket1 will be created
  + resource "aws_s3_bucket_acl" "bucket1" {
      + acl    = "private"
      + bucket = (known after apply)
      + id     = (known after apply)

      + access_control_policy {
          + grant {
              + permission = (known after apply)

              + grantee {
                  + display_name  = (known after apply)
                  + email_address = (known after apply)
                  + id            = (known after apply)
                  + type          = (known after apply)
                  + uri           = (known after apply)
                }
            }

          + owner {
              + display_name = (known after apply)
              + id           = (known after apply)
            }
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Warning: Deprecated Resource

  with data.aws_subnet_ids.all_default_subnets,
  on main.tf line 29, in data "aws_subnet_ids" "all_default_subnets":
  29: data "aws_subnet_ids" "all_default_subnets" {

The aws_subnet_ids data source has been deprecated and will be removed in a
future version. Use the aws_subnets data source instead.

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @gwright99, Action: `pull_request`, Working Directory: ``, Workflow: `Deploy Infrastructure With TF`*